{
  "name": "antennaria plantaginifolia",
  "commonname": "pussytoes",
  "description": "The late spring flowers look like tiny cat's feet, thus the name. A member of the Aster family, Pussytoes are found across much of the eastern half of the continental United States: from Minnesota south to Texas, east to Florida and north to Maine.  USDA Hardiness zones: 3-8.  Other common names in use include Woman's Tobacco and Plantain-leaved Pussytoes.  Pussytoes usually are grown for their velvety leaves rather than the white to pale pink flower. Flowers will reach up to about a foot in height but the leaves grow at ground level.  Spreading by rhizomes, Pussytoes provide a good ground cover for dry areas such as rock gardens.  Parts of the plant are poisonous so deer and rabbits and other small animals won't touch them.  A. plantaginifolia and A. neglecta can be difficult to differentiate between with their primary differences existing in their leaves. A. plantaginifolia has broader leaves with 3-5 prominent veins compared to the 1-2 prominent veins seen in the narrower leaves of A. neglecta.  Both are host larvae hosts for the American Painted Lady (Vanessa virginensis).  *This species may be difficult and/or slow to germinate and grow to maturity.  Please note the germination code.  Dormant bare-root plants ship during optimal transplanting seasons: Spring (April-May).",
  "prices": [
    {
      "quantity": 1,
      "unit": "packet",
      "price": 2.5
    },
    {
      "quantity": 0.125,
      "unit": "oz",
      "price": 30
    },
    {
      "quantity": 0.25,
      "unit": "oz",
      "price": 55
    },
    {
      "quantity": 0.5,
      "unit": "oz",
      "price": 105
    },
    {
      "quantity": 1,
      "unit": "oz",
      "price": 200
    }
  ],
  "seeds/packet": 300,
  "seeds/ounce": 275000,
  "germination": [
    "C(60)",
    "D"
  ],
  "light": [
    "Full",
    "Partial"
  ],
  "moisture": [
    "Medium",
    "Medium-Dry",
    "Dry"
  ],
  "height": 12,
  "blooms": [
    "April",
    "May",
    "June"
  ],
  "color": [
    "White"
  ],
  "features": [
    "Deer Resistant (Our experiences here in the Upper Midwest may vary in other regions; deer can respond differently to local conditions or seasonal variations.)",
    "Highly recommended for home landscaping"
  ],
  "zones": [
    3,
    4,
    5,
    6,
    7,
    8
  ],
  "spacing": {
    "min": 2,
    "max": 6
  },
  "sku": "ANT04F"
}