{
  "name": "baptisia tinctoria",
  "commonname": "small yellow wild indigo",
  "description": "When most Baptisias are done blooming, the Small Yellow Wild Indigo is in full flower, making it a great shrub-like perennial for a landscape setting.   The small flowers produce just one seed per pod unlike other Indigos, which will produce many in each pod.  Another common name in use: Yellow False Indigo. Species of genus Baptisia are legumes.\nMost legume species harbor beneficial bacteria called rhizobia on their\nroots.  Prairie Moon provides genus-specific strains of this bacterium\ncalled inoculum for legume seed free of charge with the purchase of 1\noz. or less of legume seed.  Inoculum will keep refrigerated for approximately 1 year.  To properly inoculate your legume seed prior to planting, follow germination code I.  \n Dormant bare root plants ship each year during optimal transplanting season: Fall (October) or Spring (April/May). Potted plants come in trays of 38 and ship when all plants in the tray are well-rooted and transit-ready, early May through June. Click here if you prefer to mix/match up to 6 species in a tray.",
  "prices": [
    {
      "quantity": 1,
      "unit": "packet",
      "price": 2.5
    },
    {
      "quantity": 0.125,
      "unit": "oz",
      "price": 11.25
    },
    {
      "quantity": 0.25,
      "unit": "oz",
      "price": 17.5
    }
  ],
  "seeds/packet": 75,
  "seeds/ounce": 5000,
  "germination": [
    "C(10)",
    "H",
    "I"
  ],
  "light": [
    "Full",
    "Partial"
  ],
  "moisture": [
    "Medium-Wet",
    "Medium",
    "Medium-Dry",
    "Dry"
  ],
  "height": 24,
  "blooms": [
    "June",
    "July",
    "August"
  ],
  "color": [
    "Yellow"
  ],
  "features": [
    "Pollinator Favorite: butterflies, bees and birds",
    "Deer Resistant (Our experiences here in the Upper Midwest may vary in other regions; deer can respond differently to local conditions or seasonal variations.)",
    "Highly recommended for home landscaping"
  ],
  "zones": [
    3,
    4,
    5,
    6,
    7,
    8,
    9
  ],
  "spacing": {
    "min": 2,
    "max": 3
  },
  "sku": "BAP10F"
}