{
  "name": "baptisia australis",
  "commonname": "blue wild indigo",
  "description": "Like most of its genus, Baptisia australis spends its first few years developing mostly below ground. The branching foliage and blossoms become showier and more developed with each subsequent growing season.  Probably the most familiar and wide-ranging of Baptisias, Blue Wild Indigo can provide an early deep blue flare in spring in native plantings where its bushy structure complements summer bloomers. Their 4' height and branching habit make wide spacing advisable in home landscaping.  If you have dry soils and want a smaller Blue Indigo try Baptisia minor (Dwarf Blue Indigo). Another common name in use is Blue False Indigo. Species of genus Baptisia are legumes.\nMost legume species harbor beneficial bacteria called rhizobia on their\nroots.  Prairie Moon provides genus-specific strains of this bacterium\ncalled inoculum for legume seed free of charge with the purchase of 1\noz. or less of legume seed.  Inoculum will keep refrigerated for approximately 1 year.  To properly inoculate your legume seed prior to planting, follow germination code I.  \n Dormant bare root plants ship each year during optimal transplanting season: Fall (October) or Spring (April/May).Potted plants (trays of 38) ship when all plants are well-rooted and transit-ready, early May through June. Click here if you prefer to mix/match up to 6 species in a tray.",
  "prices": [
    {
      "quantity": 1,
      "unit": "packet",
      "price": 2.5
    },
    {
      "quantity": 0.125,
      "unit": "oz",
      "price": 3
    },
    {
      "quantity": 0.25,
      "unit": "oz",
      "price": 4
    },
    {
      "quantity": 0.5,
      "unit": "oz",
      "price": 6.5
    },
    {
      "quantity": 1,
      "unit": "oz",
      "price": 10
    }
  ],
  "seeds/packet": 75,
  "seeds/ounce": 1500,
  "germination": [
    "C(10)",
    "H",
    "I"
  ],
  "light": [
    "Full",
    "Partial"
  ],
  "moisture": [
    "Medium-Wet",
    "Medium"
  ],
  "height": 48,
  "blooms": [
    "May",
    "June",
    "July"
  ],
  "color": [
    "Blue"
  ],
  "features": [
    "Pollinator Favorite: butterflies, bees and birds",
    "Deer Resistant (Our experiences here in the Upper Midwest may vary in other regions; deer can respond differently to local conditions or seasonal variations.)",
    "Highly recommended for home landscaping"
  ],
  "zones": [
    4,
    5,
    6,
    7,
    8,
    9
  ],
  "spacing": {
    "min": 2,
    "max": 3
  },
  "sku": "BAP04F"
}