{
  "name": "blephilia ciliata",
  "commonname": "downy wood mint",
  "description": "Downy Wood Mint has a distinctive appeal with its tight clusters of pink-purple flowers stacked to resemble a pagoda. Strongly supported by downy-haired stems reaching just 1', the flowers too are hairy and twin-lipped with three lobes and reddish spots on the lower lip.  The opposing leaves have tiny hairs on the undersides and small scattered teeth on the margins. Basal leaves stay green through winter.   Reminiscent of much-loved Monardas, this Blephelia will spread by rhizomes slowly from a central tap root to form clumps. Deer will not bother this member of the Mint family but important pollinators will frequent it during its approximate 1 month early summer bloom time. Downy Wood Mint can thrive in almost any medium to dry-soil garden that receives 20% or more sun per summer day making it a sure-fit for most gardens.   Originally native to the Great Lakes and Mid-Atlantic states it will flourish in any zone 4-8 state.  Other common names in use: Downy Pagoda Plant, Ohio Horse Mint.\n Dormant bare root plants ship each year during optimal transplanting season: Fall (October) or Spring (April/May).Potted plants (3-packs and trays of 38) ship when all plants are well-rooted and transit-ready, early May through June. Click here if you prefer to mix/match up to 6 species in a tray.",
  "prices": [],
  "seeds/packet": 1000,
  "seeds/ounce": 400000,
  "germination": [
    "C(60)"
  ],
  "light": [
    "Full",
    "Partial"
  ],
  "moisture": [
    "Medium",
    "Medium-Dry",
    "Dry"
  ],
  "height": 12,
  "blooms": [
    "June",
    "July"
  ],
  "color": [
    "Purple"
  ],
  "features": [
    "Pollinator Favorite: butterflies, bees and birds",
    "Deer Resistant (Our experiences here in the Upper Midwest may vary in other regions; deer can respond differently to local conditions or seasonal variations.)",
    "Highly recommended for home landscaping"
  ],
  "zones": [
    4,
    5,
    6,
    7,
    8
  ],
  "spacing": {
    "min": 10,
    "max": 18
  },
  "sku": "BLE02F"
}