{
  "name": "dalea purpurea",
  "commonname": "purple prairie clover",
  "description": "A staple legume of mostly sunny, diverse plantings in medium to dry soils. Before flowering, it can be easy to tell the Purple from the White Prairie Clover by looking at the leaves, which are wide on the White and narrow on the Purple Prairie Clover (see corresponding photo.) Previously called Petalostemum purpureum, we love Purple Prairie Clover because it can be planted in the spring, on bare soil, and will germinate without overwintering; it does not need stratification.\n This is a legume species (member of the pea family).\nMost legume species harbor beneficial bacteria called rhizobia on their\nroots.  Prairie Moon provides genus-specific strains of this bacterium\ncalled inoculum for legume seed free of charge with the purchase of 1\noz. or less of legume seed.  Inoculum will keep refrigerated for approximately 1 year.  To properly inoculate your legume seed prior to planting, follow germination code I.  \n Dormant bare root plants ship each year during optimal transplanting season: Fall (October) or Spring (April/May). Potted plants (3-packs and trays of 38) ship when all plants are well-rooted and transit-ready, early May through June. Click here if you prefer to mix/match up to 6 species in a tray.",
  "prices": [
    {
      "quantity": 1,
      "unit": "packet",
      "price": 2.5
    },
    {
      "quantity": 0.5,
      "unit": "oz",
      "price": 3
    },
    {
      "quantity": 1,
      "unit": "oz",
      "price": 4
    },
    {
      "quantity": 1,
      "unit": "lb",
      "price": 60
    }
  ],
  "seeds/packet": 750,
  "seeds/ounce": 15000,
  "germination": [
    "A",
    "I",
    "J"
  ],
  "light": [
    "Full",
    "Partial"
  ],
  "moisture": [
    "Medium",
    "Medium-Dry",
    "Dry"
  ],
  "height": 24,
  "blooms": [
    "July",
    "August",
    "September"
  ],
  "color": [
    "Purple"
  ],
  "features": [
    "Pollinator Favorite: butterflies, bees and birds",
    "Deer Resistant (Our experiences here in the Upper Midwest may vary in other regions; deer can respond differently to local conditions or seasonal variations.)",
    "Highly recommended for home landscaping"
  ],
  "zones": [
    3,
    4,
    5,
    6,
    7,
    8
  ],
  "spacing": {
    "min": 18,
    "max": 24
  },
  "sku": "PET06F"
}