{
  "name": "iliamna remota",
  "commonname": "kankakee mallow",
  "description": "A native rarity, with historic wild populations originating only to the Kankakee River, in Kankakee County, Illinois making it one of the historically rarest North American plants (see \"range map\" tab, above).  Typical of a river bank, Kankakee Mallow needs medium to medium wet soils with a preference for sandy or loamy soil and full or part sun.  The blooming period is quite sustained (about 2 months) and the individual pale pink flowers are slightly aromatic. They will eventually become pod-like fruits.  Growing in excess of 5' this mallow's stems and leaves have a light gray-appearance due to a covering of dense hairs.  The attractive maple-looking leaves can reach 6\" in diameter.  The root consists of a tap root with rhizomes and dense patches of Kankaee Mallow can develop from these rhizomes over time.  Classified in the same family as Hollyhocks, Malvaceae, Kankakee Mallow does have the overall appearance of a Hollyhock.Dormant bare root plants ship each year during optimal transplanting season: Fall (October) or Spring (April/May).",
  "prices": [
    {
      "quantity": 1,
      "unit": "packet",
      "price": 2.5
    },
    {
      "quantity": 0.125,
      "unit": "oz",
      "price": 5
    },
    {
      "quantity": 0.25,
      "unit": "oz",
      "price": 8
    },
    {
      "quantity": 0.5,
      "unit": "oz",
      "price": 13
    },
    {
      "quantity": 1,
      "unit": "oz",
      "price": 20
    }
  ],
  "seeds/packet": 200,
  "seeds/ounce": 12000,
  "germination": [
    "C(60)"
  ],
  "light": [
    "Full",
    "Partial"
  ],
  "moisture": [
    "Medium-Wet",
    "Medium"
  ],
  "height": 60,
  "blooms": [
    "July",
    "August",
    "September"
  ],
  "color": [
    "Pink"
  ],
  "features": [
    "Recommended for home landscaping but potentially aggressive; could overwhelm small landscapes"
  ],
  "zones": [
    4,
    5,
    6
  ],
  "spacing": {
    "min": 3,
    "max": 4
  },
  "sku": "ILI02F"
}