{
  "name": "pycnanthemum virginianum",
  "commonname": "mountain mint",
  "description": "Mountain Mint attracts many insects to its flowers, including various bees, wasps, flies, small butterflies, and beetles. The leaves are very fragrant; when crushed they have a strong minty odor. The flowers will be white to shades of light purple, some with purple spots.  Pycnanthemum means \"densely flowered,\" an attribute that enables Mountain Mint to accommodate many pollinators at once.  The long bloom time, a month or more in July and August, is another reason Mountain Mint is a great choice for those interested in feeding pollinators.  The light green foliage of all Mountain Mint species is visually pleasing, too, making it a nice garden choice even when not flowering.  For a shorter species, in medium soils, try Slender Mountain Mint.  Other common names are Mountain Thyme, Pennyroyal, and Prairie Hyssop. Dormant bare root plants ship each year during optimal transplanting season: Fall (October) or Spring (April/May).",
  "prices": [
    {
      "quantity": 1,
      "unit": "packet",
      "price": 2.5
    },
    {
      "quantity": 0.125,
      "unit": "oz",
      "price": 10
    },
    {
      "quantity": 0.25,
      "unit": "oz",
      "price": 15
    }
  ],
  "seeds/packet": 1000,
  "seeds/ounce": 220000,
  "germination": [
    "A",
    "D"
  ],
  "light": [
    "Full",
    "Partial"
  ],
  "moisture": [
    "Wet",
    "Medium-Wet",
    "Medium",
    "Medium-Dry"
  ],
  "height": 36,
  "blooms": [
    "June",
    "July",
    "August",
    "September"
  ],
  "color": [
    "White"
  ],
  "features": [
    "Pollinator Favorite: butterflies, bees and birds",
    "Deer Resistant (Our experiences here in the Upper Midwest may vary in other regions; deer can respond differently to local conditions or seasonal variations.)",
    "Recommended for home landscaping but potentially aggressive; could overwhelm small landscapes"
  ],
  "zones": [
    3,
    4,
    5,
    6,
    7
  ],
  "spacing": {
    "min": 12,
    "max": 18
  },
  "sku": "PYC06F"
}