{
  "name": "solidago gigantea",
  "commonname": "late goldenrod",
  "description": "Goldenrods are a diverse group of species, and some of them can be easily mistaken for each other. Late goldenrod (Solidago gigantea) is common to seasonally moist or wet, open ground. Occasionally it is found on drier ground or in part shade. The stems of late goldenrod are smooth and hairless below the inflorescence.  The similar tall (S. altissima) and Canada (S. canadensis) goldenrods are ubiquitous, rather weedy species, more common on drier ground, although they will be found on slightly wet ground also. Stems of these species are rough or hairy. We do not stock these, however they are almost certain to show up in your prairie! Late Goldenrod is rhizomatous and aggressive and therefore may not be suitable for small landscape plantings.  Whatever your preference or situation may be, there is a goldenrod to suit all occasions. Sadly, goldenrods often get blamed for causing the dreaded hayfever. This is simply not true. Their pollen is quite large and sticky so as to better adhere to the body of visiting insects. Because of this, goldenrod pollen cannot become airborne and can never make its way into your sinuses. The true cause of hayfever is the wind pollinated ragweeds, which broadcast copious amounts of lightweight pollen into the air. We cannot stress enough how important goldenrods are on the landscape. Including them on your property will provide ecosystem services well into the fall when most other plant life is shutting down.",
  "prices": [
    {
      "quantity": 1,
      "unit": "packet",
      "price": 2.5
    }
  ],
  "seeds/packet": 750,
  "seeds/ounce": 250000,
  "germination": [
    "C(60)",
    "D"
  ],
  "light": [
    "Full",
    "Partial",
    "Shade"
  ],
  "moisture": [
    "Wet",
    "Medium-Wet",
    "Medium"
  ],
  "height": 72,
  "blooms": [
    "August",
    "September"
  ],
  "color": [
    "Yellow"
  ],
  "features": [
    "Pollinator Favorite: butterflies, bees and birds",
    "Deer Resistant (Our experiences here in the Upper Midwest may vary in other regions; deer can respond differently to local conditions or seasonal variations.)"
  ],
  "sku": "SOL20F"
}