{
  "name": "tradescantia ohiensis",
  "commonname": "ohio spiderwort",
  "description": "Ohio Spiderwort (Tradescantia ohiensis) can be found growing on the south side of road ditches and in medium to dry prairies and meadows. It's also a very attractive addition to any garden and quite easy to grow from seed.  Its unusual foliage and tendency to bloom in the morning sun and close from mid-day heat and sun make this an attractive addition wherever it is found.  A stand of these long-blooming Spiderworts can be in bloom from May through July.  Seeds germinate nicely with a fall planting, or following a four-month period (approximately 120 days) of moist-cold stratification.  The Spiderworts are native throughout the country with Ohio Spiderwort being the most widespread, and most are very adaptable tolerating sand, clay and other tough sites.   Consider some of the other Spiderworts depending on your location and site conditions.\n Dormant bare root plants ship each year during optimal transplanting season: Fall (October) or Spring (April/May).Potted plants (trays of 38) ship when all plants are well-rooted and transit-ready, early May through June. Click here if you prefer to mix/match up to 6 species in a tray.",
  "prices": [
    {
      "quantity": 1,
      "unit": "packet",
      "price": 2.5
    },
    {
      "quantity": 0.125,
      "unit": "oz",
      "price": 6.25
    },
    {
      "quantity": 0.25,
      "unit": "oz",
      "price": 10
    },
    {
      "quantity": 0.5,
      "unit": "oz",
      "price": 16.25
    },
    {
      "quantity": 1,
      "unit": "oz",
      "price": 25
    }
  ],
  "seeds/packet": 150,
  "seeds/ounce": 8000,
  "germination": [
    "C(120)",
    "M",
    "G"
  ],
  "light": [
    "Full",
    "Partial"
  ],
  "moisture": [
    "Medium-Wet",
    "Medium",
    "Medium-Dry",
    "Dry"
  ],
  "height": 36,
  "blooms": [
    "May",
    "June",
    "July"
  ],
  "color": [
    "Blue"
  ],
  "features": [
    "Pollinator Favorite: butterflies, bees and birds",
    "Deer Resistant (Our experiences here in the Upper Midwest may vary in other regions; deer can respond differently to local conditions or seasonal variations.)",
    "Recommended for home landscaping but potentially aggressive; could overwhelm small landscapes"
  ],
  "zones": [
    4,
    5,
    6,
    7,
    8,
    9
  ],
  "spacing": {
    "min": 12,
    "max": 18
  },
  "sku": "TRA06F"
}