{
  "name": "zizia aurea",
  "commonname": "golden alexanders",
  "description": "Zizia aurea is one of those natives that every garden should have. It is fairly easy to grow and, although short-lived, will self-seed and persist in many sun/soil situations. Zizia is an important plant to a number of short-tongued insects that are able to easily reach the nectar in the small yellow flowers. Black Swallowtail caterpillars will feed on its leaves.  Golden Alexanders have a long bloom time, giving the garden/prairie some well-deserved early color for several weeks in late spring to early summer when many other plants have not yet flowered.  Also called Golden Zizia, Golden Alexanders will tolerate a lot of shade but prefer full sun or light shade.  Zizia is a member of the Carrot (Apiaceae) family with yellow umbel flowers. Our website also features the following species with similar blossoms: Taenidia integerrima (Yellow Pimpernel),  Polytaenia nuttallii (Prairie Parsley) and Thaspium trifoliatum (Meadow Parsnip).  Of course Zizia aptera (Heart-leaf Golden Alexanders), is most similar and could be difficult to distinguish from Zizia aurea were it not for the heart-shaped leaves at the base of the plant. Heart-leaf Golden Alexanders can endure drier soils also.  All of these important perennial native plants should not be confused with the similar-looking Pastinaca sativa (Wild Parsnip), a highly invasive Eurasian biennial commonly found on roadsides and other disturbed sites.  Wild Parsnip is taller than the aforementioned natives, blooms later and can cause painful skin burns.Potted plants (3-packs and trays of 38) ship when all plants are well-rooted and transit-ready, early May through June. Click here if you prefer to mix/match up to 6 species in a tray.",
  "prices": [
    {
      "quantity": 1,
      "unit": "packet",
      "price": 2.5
    },
    {
      "quantity": 0.125,
      "unit": "oz",
      "price": 3
    },
    {
      "quantity": 0.25,
      "unit": "oz",
      "price": 4.8
    },
    {
      "quantity": 0.5,
      "unit": "oz",
      "price": 7.8
    },
    {
      "quantity": 1,
      "unit": "oz",
      "price": 12
    }
  ],
  "seeds/packet": 150,
  "seeds/ounce": 11000,
  "germination": [
    "C(60)",
    "G",
    "M"
  ],
  "light": [
    "Full",
    "Partial"
  ],
  "moisture": [
    "Medium-Wet",
    "Medium",
    "Medium-Dry"
  ],
  "height": 36,
  "blooms": [
    "April",
    "May",
    "June"
  ],
  "color": [
    "Yellow"
  ],
  "features": [
    "Pollinator Favorite: butterflies, bees and birds",
    "Highly recommended for home landscaping"
  ],
  "zones": [
    3,
    4,
    5,
    6,
    7,
    8
  ],
  "spacing": {
    "min": 1,
    "max": 2
  },
  "sku": "ZIZ04F"
}